{
  "intents": [
    {
      "tag": "saludo",
      "patterns": [
        "Hola",
        "Buenos días",
        "Buenas tardes",
        "Buenas noches",
        "Qué tal",
        "Hey"
      ],
      "responses": [
        "¡Hola! ¿En qué puedo ayudarte hoy?",
        "¡Hola! ¿Cómo puedo asistirte?",
        "¡Hola! ¿Qué necesitas saber?"
      ]
    },
    {
      "tag": "informacion_universidad",
      "patterns": [
        "Cuéntame sobre la universidad",
        "¿Qué ofrece la universidad?",
        "Información sobre la universidad",
        "Háblame de la universidad"
      ],
      "responses": [
        "Nuestra universidad ofrece una amplia variedad de programas académicos, instalaciones modernas y un ambiente inclusivo para todos los estudiantes. ¿Te gustaría saber más sobre nuestros programas o instalaciones?"
      ]
    },
    {
      "tag": "horarios_clases",
      "patterns": [
        "¿Qué dias son las clases?",
        "Horarios de clases",
        "¿Cuando empiezan las clases?",
        "Horarios de las clases"
      ],
      "responses": [
        "Las clases se imparten de lunes a viernes en varios horarios. Puedes consultar el horario específico de tu programa en el portal del estudiante.",
        "Las clases empieza un 1 de Marzo según la resolución Vigente de la Universidad",
        "Los horarios de clase puedes consultarlo en tu portal de divisist en la sección de horario."
      ]
    },
    {
      "tag": "beca_trabajo",
      "patterns": [
        "Información sobre becas de trabajo",
        "¿Hay becas de trabajo disponibles?",
        "Becas de trabajo universitarias",
        "¿Cómo puedo solicitar una beca de trabajo?"
      ],
      "responses": [
        "Ofrecemos diversas becas de trabajo para estudiantes. Para más detalles sobre cómo solicitar una beca de trabajo, visita nuestra página web de becas o comunícate con la oficina de ayuda financiera.",
        "El servicio de beca trabajo ya no están disponible, tienes que esperar para el siguiente semestre y estar pendiende del portal Divisist."
      ]
    },
    {
      "tag": "contacto",
      "patterns": [
        "Información de contacto",
        "¿Cómo puedo contactar con la universidad?",
        "Contacto universidad",
        "Teléfono de la universidad"
      ],
      "responses": [
        "Puedes contactarnos al teléfono (607)5776655 o enviarnos un correo electrónico a ugad@ufps.edu.co. También puedes visitarnos en nuestra oficina principal de lunes a viernes de 8 am a 5 pm."
      ]
    },
    {
      "tag": "ubicacion",
      "patterns": [
        "¿Dónde está ubicada la universidad?",
        "Ubicación de la universidad",
        "Dirección de la universidad"
      ],
      "responses": [
        "Nuestra universidad está ubicada Avenida Gran. Colombia #12E-96. Barrio Colsag. Para más detalles, visita nuestra página de contacto en el sitio web."
      ]
    },
    {
      "tag": "admisiones",
      "patterns": [
        "Proceso de admisión",
        "¿Cómo puedo inscribirme?",
        "Requisitos de admisión",
        "Inscripción universidad"
      ],
      "responses": [
        "Para inscribirte, necesitas completar el formulario de admisión disponible en nuestro sitio web, enviar tus transcripciones académicas y cumplir con los requisitos específicos de tu programa de interés. Visita nuestra página de admisiones para más detalles y seguir el proceso de manera correcta."
      ]
    },
    {
      "tag": "cursos",
      "patterns": [
        "¿Qué cursos ofrecen?",
        "Programas académicos",
        "Carreras disponibles",
        "Oferta académica"
      ],
      "responses": [
        "Ofrecemos una variedad de programas académicos en áreas como ingeniería, ciencias, humanidades, negocios, y más. En muchas de estas ofrecemos con una acreditación de alta calidad.Visita nuestra página de programas académicos para ver la lista completa de cursos y carreras disponibles."
      ]
    },
    {
      "tag": "creador",
      "patterns": [
        "quien fue que te creo",
        "es tu creador",
        "te hizo",
        "te creo",
        "quien te ha creado",
        "cual es tu creador",
        "quiero saber quien te hizo",
        "sabes quien te creo"
      ],
      "responses": [
        "Los estudiantes de Ingenieria de sistemas de 7mo semestre."
      ]
    },
    {
      "tag": "amigos_academicos",
      "patterns": [
        "¿Quienes son los amigos academicos?",
        "¿Cual es el horario de los amigos academicos",
        "¿Con que materias me pueden ayudar los amigos academicos?"
      ],
      "responses": [
        "Los amigos academicos son: Luis Carreño, Julian Quiroz, Kevin Tarazona, Andersson Cardenas, Henry Blanco",
        "El horario de los amigos academicos son los Lunes a Viernes de 2 pm a 6 pm",
        "Los amigos academicos te pueden ayudar con cualquier materia que presentes dificultad, tales como: Programacion, Calculo, Fisica, Matematicas Discretas, etc... Animate a visitarlos"
      ]
    },
    {
      "tag": "materias",
      "patterns": [
        "¿Cuáles son las materias del primer semestre?",
        "Materias del semestre",
        "Asignaturas disponibles"
      ],
      "responses": [
        "Las materias del primer semestre varían según tu semestre de estudio. Puedes consultar las materias ofrecidas en el semestre portal de Divisist para obtener una lista detallada de asignaturas que tendras que cursas en tu semestre academico."
      ]
    },
    {
      "tag": "creditos_carrera",
      "patterns": [
        "¿Cuántos créditos necesito para graduarme?",
        "Créditos necesarios para graduarse",
        "Requisitos de créditos"
      ],
      "responses": [
        "El número de créditos necesarios para graduarse es de 164, ya que es el número total de creditos de la carrera Ingenieria de Sistemas."
      ]
    },
    {
      "tag": "capsulas_aprendizaje",
      "patterns": [
        "¿Qué son las cápsulas de aprendizaje?",
        "Cápsulas de aprendizaje",
        "Información sobre cápsulas de aprendizaje"
      ],
      "responses": [
        "Las cápsulas de aprendizaje son recursos educativos breves que realizan los amigos academicos diseñados para ayudarte a comprender mejor los conceptos clave de tus cursos.",
        "La capsulas de aprendizaje son temas principalmente de programacion.",
        "La proxima capsula de aprendizaje es acerca de recursividad y será dictada por Luis Carreño y Julian Quiroz."
      ]
    },
    {
      "tag": "semilleros",
      "patterns": [
        "¿Qué son los semilleros?",
        "Información sobre semilleros",
        "Participar en semilleros"
      ],
      "responses": [
        "Los semilleros son grupos de investigación donde los estudiantes pueden participar en proyectos académicos y científicos.",
        "En Ingeniera de sistemas los semilleros que existen son: Silux, SiaWeb, Viral, "
      ]
    },
    {
      "tag": "horario_semilleros",
      "patterns": [
        "Horarios de los semilleros",
        "¿Cuándo se reúnen los semilleros?",
        "Calendario de semilleros"
      ],
      "responses": [
        "Los horarios de los semilleros varían según el grupo y el proyecto. Puedes encontrar el calendario específico en la página de cada semillero en el portal de investigación."
      ]
    },
    {
      "tag": "prestacion_salas",
      "patterns": [
        "¿Cómo puedo reservar una sala de estudio?",
        "Reserva de salas de estudio",
        "Préstamo de salas"
      ],
      "responses": [
        "Para reservar una sala de estudio, puedes dirigirte a la directora del programa o jefe del departamento."
      ]
    },
    {
      "tag": "cantidad_profesores",
      "patterns": [
        "¿Cuántos profesores hay en la universidad?",
        "Número de profesores",
        "Personal docente"
      ],
      "responses": [
        "En el progrma cuenta con más de 30 profesores en diversas disciplinas, todos altamente calificados y dedicados a la excelencia académica."
      ]
    },
    {
      "tag": "requisitos_grado",
      "patterns": [
        "¿Cuales son los requisitos para graduarme?",
        "¿Que necesito hacer para graduarme?",
        "¿Cuantas cosas tengo que hacer para gruadarme?",
        "¿Me puedo graduar realizando cursos de profundizacion?",
        "Es necesario la tesis para graduarme?",
        "¿Necesito realizar el examen de ingles para graduarme?"
      ],
      "responses": [
        "Los requisitos de grado que debes realizar, es terminar todo los créditos del pensum (164). Además de realizar 3 materias eletivas socio-humanisticas y 6 electivas materias profesionales. También debes realizar 2 cursos de profundización y realizar un proyecto de investigacion de pregrado o un curso de profundizacion",
        "Puedes graduarte realizando un curso de profundizacion o con tesis. Como mejor te parezca. Debes tener en cuenta que deber terminar todas tus materias para la presentación del examen de profundización o la sustentación de la tesis.",
        "Es obligatorio realizar la tesis o curso de profundizacion para graduarte.",
        "El examen de ingles es obligatorio para graduarte, este examen lo puedes realizar desde 1er semestre."
      ]
    }
  ]
}
